app/controllers/home_controller.rb

SELECT `users`.* FROM `users` WHERE (id != '2')
---
  def you_can_follow
  	@users = User.all.where("id != ?","#{current_user.id}")

SELECT `users`.* FROM `users` WHERE `users`.`following_id` = 2
---
  def follow
  	followers = current_user.followers.map(&:id)
  	if followers.include?(params["id"])
  		flash.now[:error] = "You are already following"
  	else
  		current_user.following << User.find(params["id"])