app/controllers/tweets_controller.rb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 1
---
  def index
  	@tweets = current_user.followers.map(&:tweets).first